ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
#define RCC_CFGR_MCO2SEL_VALUE(n)           ((n) << RCC_CFGR_MCO2SEL_Pos)
#define RCC_CFGR_MCO2SEL_NOCLOCK            RCC_CFGR_MCO2SEL_VALUE(0)
#define RCC_CFGR_MCO2SEL_SYSCLK             RCC_CFGR_MCO2SEL_VALUE(1)
#define RCC_CFGR_MCO2SEL_MSI                RCC_CFGR_MCO2SEL_VALUE(2)
#define RCC_CFGR_MCO2SEL_HSI16              RCC_CFGR_MCO2SEL_VALUE(3)
#define RCC_CFGR_MCO2SEL_HSE                RCC_CFGR_MCO2SEL_VALUE(4)
#define RCC_CFGR_MCO2SEL_PLLRCLK            RCC_CFGR_MCO2SEL_VALUE(5)
#define RCC_CFGR_MCO2SEL_LSI                RCC_CFGR_MCO2SEL_VALUE(6)
#define RCC_CFGR_MCO2SEL_LSE                RCC_CFGR_MCO2SEL_VALUE(7)
#define RCC_CFGR_MCO2SEL_HSI48              RCC_CFGR_MCO2SEL_VALUE(8)
#define RCC_CFGR_MCO2SEL_RTCCLK             RCC_CFGR_MCO2SEL_VALUE(9)
#define RCC_CFGR_MCO2SEL_RTCWKP             RCC_CFGR_MCO2SEL_VALUE(10)

#define RCC_CFGR_MCO2PRE_VALUE(n)           ((n) << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE_DIV1               RCC_CFGR_MCO2PRE_VALUE(0)
#define RCC_CFGR_MCO2PRE_DIV2               RCC_CFGR_MCO2PRE_VALUE(1)
#define RCC_CFGR_MCO2PRE_DIV4               RCC_CFGR_MCO2PRE_VALUE(2)
#define RCC_CFGR_MCO2PRE_DIV8               RCC_CFGR_MCO2PRE_VALUE(3)
#define RCC_CFGR_MCO2PRE_DIV16              RCC_CFGR_MCO2PRE_VALUE(4)
#define RCC_CFGR_MCO2PRE_DIV32              RCC_CFGR_MCO2PRE_VALUE(5)
#define RCC_CFGR_MCO2PRE_DIV64              RCC_CFGR_MCO2PRE_VALUE(6)
#define RCC_CFGR_MCO2PRE_DIV128             RCC_CFGR_MCO2PRE_VALUE(7)
#define RCC_CFGR_MCO2PRE_DIV256             RCC_CFGR_MCO2PRE_VALUE(8)
#define RCC_CFGR_MCO2PRE_DIV512             RCC_CFGR_MCO2PRE_VALUE(9)
#define RCC_CFGR_MCO2PRE_DIV1024            RCC_CFGR_MCO2PRE_VALUE(10)

#define RCC_CFGR_MCO1SEL_VALUE(n)           ((n) << RCC_CFGR_MCO1SEL_Pos)
#define RCC_CFGR_MCO1SEL_NOCLOCK            RCC_CFGR_MCO1SEL_VALUE(0)
#define RCC_CFGR_MCO1SEL_SYSCLK             RCC_CFGR_MCO1SEL_VALUE(1)
#define RCC_CFGR_MCO1SEL_MSI                RCC_CFGR_MCO1SEL_VALUE(2)
#define RCC_CFGR_MCO1SEL_HSI16              RCC_CFGR_MCO1SEL_VALUE(3)
#define RCC_CFGR_MCO1SEL_HSE                RCC_CFGR_MCO1SEL_VALUE(4)
#define RCC_CFGR_MCO1SEL_PLLRCLK            RCC_CFGR_MCO1SEL_VALUE(5)
#define RCC_CFGR_MCO1SEL_LSI                RCC_CFGR_MCO1SEL_VALUE(6)
#define RCC_CFGR_MCO1SEL_LSE                RCC_CFGR_MCO1SEL_VALUE(7)
#define RCC_CFGR_MCO1SEL_HSI48              RCC_CFGR_MCO1SEL_VALUE(8)
#define RCC_CFGR_MCO1SEL_RTCCLK             RCC_CFGR_MCO1SEL_VALUE(9)
#define RCC_CFGR_MCO1SEL_RTCWKP             RCC_CFGR_MCO1SEL_VALUE(10)

#define RCC_CFGR_MCO1PRE_VALUE(n)           ((n) << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE_DIV1               RCC_CFGR_MCO1PRE_VALUE(0)
#define RCC_CFGR_MCO1PRE_DIV2               RCC_CFGR_MCO1PRE_VALUE(1)
#define RCC_CFGR_MCO1PRE_DIV4               RCC_CFGR_MCO1PRE_VALUE(2)
#define RCC_CFGR_MCO1PRE_DIV8               RCC_CFGR_MCO1PRE_VALUE(3)
#define RCC_CFGR_MCO1PRE_DIV16              RCC_CFGR_MCO1PRE_VALUE(4)
#define RCC_CFGR_MCO1PRE_DIV32              RCC_CFGR_MCO1PRE_VALUE(5)
#define RCC_CFGR_MCO1PRE_DIV64              RCC_CFGR_MCO1PRE_VALUE(6)
#define RCC_CFGR_MCO1PRE_DIV128             RCC_CFGR_MCO1PRE_VALUE(7)
#define RCC_CFGR_MCO1PRE_DIV256             RCC_CFGR_MCO1PRE_VALUE(8)
#define RCC_CFGR_MCO1PRE_DIV512             RCC_CFGR_MCO1PRE_VALUE(9)
#define RCC_CFGR_MCO1PRE_DIV1024            RCC_CFGR_MCO1PRE_VALUE(10)
/** @} */

/**
 * @name    RCC_PLLCFGR register helpers
 * @{
 */
#define RCC_PLLCFGR_PLLSRC_VALUE(n)         ((n) << RCC_PLLCFGR_PLLSRC_Pos)
#define RCC_PLLCFGR_PLLSRC_NOCLOCK          RCC_PLLCFGR_PLLSRC_VALUE(0U)
#define RCC_PLLCFGR_PLLSRC_MSI              RCC_PLLCFGR_PLLSRC_VALUE(1U)
#define RCC_PLLCFGR_PLLSRC_HSI16            RCC_PLLCFGR_PLLSRC_VALUE(2U)
#define RCC_PLLCFGR_PLLSRC_HSE              RCC_PLLCFGR_PLLSRC_VALUE(3U)
/** @} */

/**
 * @name    RCC_CCIPR register helpers
 * @{
 */
#define RCC_CCIPR_USART1SEL_PCLK            (0U << RCC_CCIPR_USART1SEL_Pos)
#define RCC_CCIPR_USART1SEL_SYSCLK          (1U << RCC_CCIPR_USART1SEL_Pos)
#define RCC_CCIPR_USART1SEL_HSI16           (2U << RCC_CCIPR_USART1SEL_Pos)
#define RCC_CCIPR_USART1SEL_LSE             (3U << RCC_CCIPR_USART1SEL_Pos)

#define RCC_CCIPR_USART2SEL_PCLK            (0U << RCC_CCIPR_USART2SEL_Pos)
#define RCC_CCIPR_USART2SEL_SYSCLK          (1U << RCC_CCIPR_USART2SEL_Pos)
#define RCC_CCIPR_USART2SEL_HSI16           (2U << RCC_CCIPR_USART2SEL_Pos)
#define RCC_CCIPR_USART2SEL_LSE             (3U << RCC_CCIPR_USART2SEL_Pos)

#define RCC_CCIPR_LPUART3SEL_PCLK           (0U << RCC_CCIPR_LPUART3SEL_Pos)
#define RCC_CCIPR_LPUART3SEL_SYSCLK         (1U << RCC_CCIPR_LPUART3SEL_Pos)
#define RCC_CCIPR_LPUART3SEL_HSI16          (2U << RCC_CCIPR_LPUART3SEL_Pos)
#define RCC_CCIPR_LPUART3SEL_LSE            (3U << RCC_CCIPR_LPUART3SEL_Pos)

#define RCC_CCIPR_LPUART2SEL_PCLK           (0U << RCC_CCIPR_LPUART2SEL_Pos)
#define RCC_CCIPR_LPUART2SEL_SYSCLK         (1U << RCC_CCIPR_LPUART2SEL_Pos)
#define RCC_CCIPR_LPUART2SEL_HSI16          (2U << RCC_CCIPR_LPUART2SEL_Pos)
#define RCC_CCIPR_LPUART2SEL_LSE            (3U << RCC_CCIPR_LPUART2SEL_Pos)

#define RCC_CCIPR_LPUART1SEL_PCLK           (0U << RCC_CCIPR_LPUART1SEL_Pos)
#define RCC_CCIPR_LPUART1SEL_SYSCLK         (1U << RCC_CCIPR_LPUART1SEL_Pos)
#define RCC_CCIPR_LPUART1SEL_HSI16          (2U << RCC_CCIPR_LPUART1SEL_Pos)
#define RCC_CCIPR_LPUART1SEL_LSE            (3U << RCC_CCIPR_LPUART1SEL_Pos)

#define RCC_CCIPR_I2C1SEL_PCLK              (0U << RCC_CCIPR_I2C1SEL_Pos)
#define RCC_CCIPR_I2C1SEL_SYSCLK            (1U << RCC_CCIPR_I2C1SEL_Pos)
#define RCC_CCIPR_I2C1SEL_HSI16             (2U << RCC_CCIPR_I2C1SEL_Pos)

#define RCC_CCIPR_I2C3SEL_PCLK              (0U << RCC_CCIPR_I2C3SEL_Pos)
#define RCC_CCIPR_I2C3SEL_SYSCLK            (1U << RCC_CCIPR_I2C3SEL_Pos)
#define RCC_CCIPR_I2C3SEL_HSI16             (2U << RCC_CCIPR_I2C3SEL_Pos)

#define RCC_CCIPR_LPTIM1SEL_PCLK            (0U << RCC_CCIPR_LPTIM1SEL_Pos)
#define RCC_CCIPR_LPTIM1SEL_LSI             (1U << RCC_CCIPR_LPTIM1SEL_Pos)
#define RCC_CCIPR_LPTIM1SEL_HSI16           (2U << RCC_CCIPR_LPTIM1SEL_Pos)
#define RCC_CCIPR_LPTIM1SEL_LSE             (3U << RCC_CCIPR_LPTIM1SEL_Pos)

