ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32U0xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U0xx_MCUCONF not defined"
#endif

#if defined(STM32U031xx) && !defined(STM32U031_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U031_MCUCONF not defined"

#elif defined(STM32U073xx) && !defined(STM32U073_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U073_MCUCONF not defined"

#elif defined(STM32U083xx) && !defined(STM32U083_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U083_MCUCONF not defined"

#endif

/*
 * Board files sanity checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif

#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif

#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined in board.h"
#endif

/* Device limits.*/
#include "stm32_limits.h"

/* Clock handlers.*/
#include "stm32_msi.inc"
#include "stm32_lse.inc"
#include "stm32_lsi.inc"
#include "stm32_hsi16.inc"
#include "stm32_hsi48.inc"
#include "stm32_hse.inc"

/*
 * HSI16 related checks.
 */
#if STM32_HSI16_ENABLED
#else /* !STM32_HSI16_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_HSI16
    #error "HSI16 not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == RCC_CFGR_SW_PLLR) && (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSI16)
    #error "HSI16 not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  #if (STM32_MCO1SEL == RCC_CFGR_MCO1SEL_HSI16) ||                          \
      ((STM32_MCO1SEL == RCC_CFGR_MCO1SEL_PLLRCLK) && (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSI16))
    #error "HSI16 not enabled, required by MCO"
  #endif

  #if (STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSI16) ||                          \
      ((STM32_MCO2SEL == RCC_CFGR_MCO2SEL_PLLRCLK) &&  (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSI16))
    #error "HSI16 not enabled, required by MCO2"
  #endif

  #if (STM32_USART1SEL == RCC_CCIPR_USART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART2SEL == RCC_CCIPR_USART2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_USART2SEL"
  #endif
  #if (STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPUART1SEL"
  #endif
  #if (STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPUART2SEL"
  #endif
  #if (STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPUART3SEL"
  #endif

  #if (STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_I2C1SEL"
  #endif
  #if (STM32_I2C3SEL == RCC_CCIPR_I2C3SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_I2C3SEL"
  #endif

  #if (STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_HSI16)
    #error "HSI16 not enabled, required by STM32_LPTIM3SEL"
  #endif

  #if (STM32_ADCSEL == RCC_CCIPR_ADCSEL_HSI16)
    #error "HSI16 not enabled, required by STM32_ADCSEL"
  #endif

#endif /* !STM32_HSI16_ENABLED */

/*
 * HSI48 related checks.
 */
#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_MCO1SEL == RCC_CFGR_MCO1SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_HSI48) &&                       \
      ((HAL_USE_USB == TRUE) || (HAL_USE_TRNG == TRUE))
    #error "HSI48 not enabled, required by STM32_CLK48SEL"
  #endif

#endif /* !STM32_HSI48_ENABLED */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED
#else /* !STM32_HSE_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if (STM32_SW == RCC_CFGR_SW_PLLR) && (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSE)
    #error "HSE not enabled, required by STM32_SW and STM32_PLLSRC"
  #endif

  #if (STM32_MCO1SEL == RCC_CFGR_MCO1SEL_HSE) ||                            \
      ((STM32_MCO1SEL == RCC_CFGR_MCO1SEL_PLLRCLK) &&                       \
       (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSE))
    #error "HSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if (STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSE) ||                            \
      ((STM32_MCO2SEL == RCC_CFGR_MCO2SEL_PLLRCLK) &&                       \
       (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSE))
    #error "HSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_RTCSEL == RCC_BDCR_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

#endif /* !STM32_HSE_ENABLED */

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_LSI
    #error "LSI not enabled, required by STM32_SW"
  #endif

  #if HAL_USE_RTC && (STM32_RTCSEL == RCC_BDCR_RTCSEL_LSI)
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCO1SEL == RCC_CFGR_MCO1SEL_LSI
    #error "LSI not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSI
    #error "LSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == RCC_BDCR_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

  #if (STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM3SEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

