ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV4
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 4)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV8
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 8)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV16
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 16)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV32
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 32)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV64
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 64)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV128
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 128)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV256
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 256)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV512
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 512)

#elif STM32_MCO1PRE == RCC_CFGR_MCO1PRE_DIV1024
  #define STM32_MCO1CLK                     (STM32_MCO1DIVCLK / 1024)

#else
  #error "invalid STM32_MCO1PRE value specified"
#endif

/**
 * @brief   MCO2 divider clock source.
 */
#if (STM32_MCO2SEL == RCC_CFGR_MCO2SEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCO2DIVCLK                  0

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_SYSCLK
  #define STM32_MCO2DIVCLK                  STM32_SYSCLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_MSI
  #define STM32_MCO2DIVCLK                  STM32_MSICLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSI16
  #define STM32_MCO2DIVCLK                  STM32_HSI16CLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSE
  #define STM32_MCO2DIVCLK                  STM32_HSECLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_PLLRCLK
  #define STM32_MCO2DIVCLK                  STM32_PLL_R_CLKOUT

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSI
  #define STM32_MCO2DIVCLK                  STM32_LSICLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSE
  #define STM32_MCO2DIVCLK                  STM32_LSECLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_HSI48
  #define STM32_MCO2DIVCLK                  STM32_HSI48CLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_RTCCLK
  #define STM32_MCO2DIVCLK                  STM32_RTCCLK

#elif STM32_MCO2SEL == RCC_CFGR_MCO2SEL_RTCWKP
  #define STM32_MCO2DIVCLK                  0   /* TODO */

#else
  #error "invalid STM32_MCO1SEL value specified"
#endif

/**
 * @brief   MCO2 output pin clock divider.
 */
#if (STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCO2CLK                     STM32_MCO2DIVCLK

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV2
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 2)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV4
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 4)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV8
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 8)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV16
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 16)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV32
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 32)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV64
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 64)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV128
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 128)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV256
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 256)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV512
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 512)

#elif STM32_MCO2PRE == RCC_CFGR_MCO2PRE_DIV1024
  #define STM32_MCO2CLK                     (STM32_MCO2DIVCLK / 1024)

#else
  #error "invalid STM32_MCO2PRE value specified"
#endif

/**
 * @brief   LSCO clock source.
 */
#if (STM32_LSCOSEL == RCC_BDCR_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCOCLK                     0

#elif STM32_LSCOSEL == RCC_BDCR_LSCOSEL_LSI
  #define STM32_LSCOCLK                     STM32_LSICLK

#elif STM32_LSCOSEL == RCC_BDCR_LSCOSEL_LSE
  #define STM32_LSCOCLK                     STM32_LSECLK

#else
  #error "invalid STM32_LSCOSEL value specified"
#endif

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == RCC_BDCR_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK                      0

#elif STM32_RTCSEL == RCC_BDCR_RTCSEL_LSE
  #define STM32_RTCCLK                      STM32_LSECLK

#elif STM32_RTCSEL == RCC_BDCR_RTCSEL_LSI
  #define STM32_RTCCLK                      STM32_LSICLK

#elif STM32_RTCSEL == RCC_BDCR_RTCSEL_HSEDIV
  #define STM32_RTCCLK                      (STM32_HSECLK / 32)

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == RCC_CCIPR_USART1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART1CLK                   hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART1SEL == RCC_CCIPR_USART1SEL_SYSCLK
  #define STM32_USART1CLK                   hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART1SEL == RCC_CCIPR_USART1SEL_HSI16
  #define STM32_USART1CLK                   hal_lld_get_clock_point(CLK_HSI16)

#elif STM32_USART1SEL == RCC_CCIPR_USART1SEL_LSE
  #define STM32_USART1CLK                   STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART2 clock frequency.
 */
#if (STM32_USART2SEL == RCC_CCIPR_USART2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART2CLK                   hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART2SEL == RCC_CCIPR_USART2SEL_SYSCLK
  #define STM32_USART2CLK                   hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART2SEL == RCC_CCIPR_USART2SEL_HSI16
  #define STM32_USART2CLK                   hal_lld_get_clock_point(CLK_HSI16)

#elif STM32_USART2SEL == RCC_CCIPR_USART2SEL_LSE
  #define STM32_USART2CLK                   STM32_LSECLK

#else
  #error "invalid source selected for USART2 clock"
#endif

/**
 * @brief   LPUART1 clock frequency.
 */
#if (STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPUART1CLK                  hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_SYSCLK
  #define STM32_LPUART1CLK                  hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_HSI16
  #define STM32_LPUART1CLK                  hal_lld_get_clock_point(CLK_HSI16)

#elif STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_LSE
  #define STM32_LPUART1CLK                  STM32_LSECLK

#else
  #error "invalid source selected for LPUART1 clock"
#endif

/**
 * @brief   LPUART2 clock frequency.
 */
#if (STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPUART2CLK                  hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_SYSCLK
  #define STM32_LPUART2CLK                  hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_HSI16
  #define STM32_LPUART2CLK                  hal_lld_get_clock_point(CLK_HSI16)

#elif STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_LSE
  #define STM32_LPUART2CLK                  STM32_LSECLK

#else
  #error "invalid source selected for LPUART2 clock"
#endif

/**
 * @brief   LPUART3 clock frequency.
 */
#if (STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPUART3CLK                  hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_SYSCLK
  #define STM32_LPUART3CLK                  hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_HSI16
  #define STM32_LPUART3CLK                  hal_lld_get_clock_point(CLK_HSI16)

#elif STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_LSE
  #define STM32_LPUART3CLK                  STM32_LSECLK

#else
  #error "invalid source selected for LPUART3 clock"
#endif

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK                     hal_lld_get_clock_point(CLK_PCLK)

